Documents/УстановкаЦенНаЛекарства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>УстановкаЦенНаЛекарства</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНаЛекарства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Медикаменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Лекарство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныНаЛекарства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНаЛекарства</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Лекарство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УстановкаЦенНаЛекарства/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
    Движения.ЦеныНаЛекарства.Записывать = Истина;

    Для Каждого ТекСтрокаМедикаменты Из Медикаменты Цикл
        // Добавление движения для лекарства
        Движение = Движения.ЦеныНаЛекарства.Добавить();
        Движение.Период = Дата;
        Движение.Лекарство = ТекСтрокаМедикаменты.Лекарство;
        Движение.Цена = ТекСтрокаМедикаменты.Цена;
    КонецЦикла;

КонецПроцедуры
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    Для Каждого ТекСтрокаМедикаменты Из Медикаменты Цикл
        Если ТекСтрокаМедикаменты.Лекарство.Пустая() Тогда
            Отказ = Истина;
        Иначе
            Запрос = Новый Запрос;
            Запрос.Текст = 
                "ВЫБРАТЬ ПЕРВЫЕ 1
                |   ЦеныНаЛекарства.Цена
                |ИЗ
                |   РегистрСведений.ЦеныНаЛекарства КАК ЦеныНаЛекарства
                |ГДЕ
                |   ЦеныНаЛекарства.Лекарство = &Лекарство
                |   И ЦеныНаЛекарства.Период МЕЖДУ &НачалоМесяца И &КонецМесяца";

            Запрос.УстановитьПараметр("Лекарство", ТекСтрокаМедикаменты.Лекарство);
            Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ЭтотОбъект.Дата));
            Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ЭтотОбъект.Дата));

            Результат = Запрос.Выполнить();
            Если Результат.Пустой() = Ложь Тогда
                Отказ = Истина;
                Сообщить("Цена для лекарства '" + ТекСтрокаМедикаменты.Лекарство + "' уже установлена в текущем месяце.");
                Прервать;
            КонецЕсли;
        КонецЕсли;
	КонецЦикла;           
	
		
		УникальныеЗаписи = Новый Соответствие();
	Для Каждого ТекСтрокаМедикаменты Из Медикаменты Цикл
			Если УникальныеЗаписи.Получить(ТекСтрокаМедикаменты.Лекарство) <> Неопределено Тогда
			Отказ = Истина;
			Сообщить("Лекарство '" + ТекСтрокаМедикаменты.Лекарство + "' уже существует в документе.");
		Прервать;
		КонецЕсли;
			УникальныеЗаписи.Вставить(ТекСтрокаМедикаменты.Лекарство, Истина);
		КонецЦикла;	

    Если ЭтотОбъект.Медикаменты.Количество() = 0 Тогда
        Отказ = Истина;
        Сообщить("Запись не может быть пустой.");
        Возврат;
    КонецЕсли;
КонецПроцедуры
